# Дана последовательность чисел. Получить список неповторяющихся элементов исходной последовательности
# Пример: [1, 2, 3, 5, 1, 5, 3, 10] => [1, 2, 3, 5, 10]

list_1 = [1, 2, 3, 5, 1, 5, 3, 10]
print(list_1)
set_1 = set(list_1)
print(set_1)
